test/setup_distributedChannelToy_mpi2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Toy reproducer controlDict.
//
// 5 PISO time steps is enough for the bug to manifest at proc faces
// (HPC bisect run 1 saw first divergence in step 1) while keeping the
// per-checkpoint full-dump tree small (~200 files per rank per step).
//
// The `executor` entry is required by NeoFOAM's createAdapterRunTime;
// hpc-toy-bisect.sh patches this between runs (CPUExecutor / GPUExecutor).

application     neoIcoFoam;

executor        CPUExecutor;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.005;

deltaT          0.001;

writeControl    runTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   16;

runTimeModifiable true;

// ************************************************************************* //
