test/setup_distributedChannelToy_mpi2/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Single-phase Newtonian.
// With U_inlet = 0.1 m/s and L = 1 m, Re = 0.1 / 1e-3 = 100.
nu              [0 2 -1 0 0 0 0] 1e-3;

// Also kept under the laplacianFoam-style key in case downstream tooling reads it.
DT              4e-05;


// ************************************************************************* //
