test/setup_distributedChannelToy_mpi2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  diagonal;
        tolerance       0.0;
        relTol          1e-5;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  none;
        tolerance       1e-12;
        relTol          0.0;
    }
}

PISO
{
    momentumPredictor       yes;
    nCorrectors             2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
